In [3]:
import pandas as pd
std_data=[(1,'Aayush',16,'male','Kuleswor'),
          (2,'Amit',24,'male','Dhapakhel'),
          (3,'Yojana',22,'female','Kapan'),
          (4,'Samir',22,'male','Tinkune'),
          (5,'Luckey',23,'female','Balkumari')]
df=pd.DataFrame(std_data,columns=['stud_id','name','age','gender','address'])
print(df)

   stud_id    name  age  gender    address
0        1  Aayush   16    male   Kuleswor
1        2    Amit   24    male  Dhapakhel
2        3  Yojana   22  female      Kapan
3        4   Samir   22    male    Tinkune
4        5  Luckey   23  female  Balkumari

In [4]:
df=pd.read_csv("student.csv")
df

      stud_id    name  age  gender    address
0         1    Aayush   16    male   Kuleswor
1         2      Amit   24    male  Dhapakhel
2         3    Yojana   22  female      Kapan
3         4     Samir   22    male    Tinkune
4         5    Luckey   23  female  Balkumari

In [5]:
df.head(2)

      stud_id    name  age  gender    address
0         1    Aayush   16    male   Kuleswor
1         2      Amit   24    male  Dhapakhel

In [6]:
df.tail(3)

      stud_id    name  age  gender    address
2         3    Yojana   22  female      Kapan
3         4     Samir   22    male    Tinkune
4         5    Luckey   23  female  Balkumari

In [7]:
df.shape

(5, 1)

In [8]:
df.columns

Index(['   stud_id    name  age  gender    address'], dtype='object')

In [10]:
df.size

5

In [11]:
df.dtypes

stud_id    name  age  gender    address    object
dtype: object

In [12]:
df.values

array([['       1    Aayush   16    male   Kuleswor'],
       ['       2      Amit   24    male  Dhapakhel'],
       ['       3    Yojana   22  female      Kapan'],
       ['       4     Samir   22    male    Tinkune'],
       ['       5    Luckey   23  female  Balkumari']], dtype=object)

In [13]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
df

      stud_id    name  age  gender    address
0         1    Aayush   16    male   Kuleswor
1         2      Amit   24    male  Dhapakhel
2         3    Yojana   22  female      Kapan
3         4     Samir   22    male    Tinkune
4         5    Luckey   23  female  Balkumari

In [15]:
df

      stud_id    name  age  gender    address
0         1    Aayush   16    male   Kuleswor
1         2      Amit   24    male  Dhapakhel
2         3    Yojana   22  female      Kapan
3         4     Samir   22    male    Tinkune
4         5    Luckey   23  female  Balkumari

In [8]:
import pandas as pd
df=pd.read_csv("student.csv")
df

   stud_id    name  age  gender    address
0        1    Amit   24    male  Dhapakhel
1        2  Yojana   22  female      Kapan
2        3   Samir   22    male    Tinkune
3        4  Luckey   23  female  Balkumari
4        5  Aayush   16    male   Kuleswor

In [11]:
#Selecting rows and columns
#select a single column
df['age']

0    24
1    22
2    22
3    23
4    16
Name: age, dtype: int64

In [12]:
#select multiple columns
df[['name','address']]

     name    address
0    Amit  Dhapakhel
1  Yojana      Kapan
2   Samir    Tinkune
3  Luckey  Balkumari
4  Aayush   Kuleswor

In [13]:
#Select a single row by index label
df.loc[0]

stud_id            1
name            Amit
age               24
gender          male
address    Dhapakhel
Name: 0, dtype: object

In [14]:
#select multiple rows by index labels
df.loc[[0,2,4]]

   stud_id    name  age gender    address
0        1    Amit   24   male  Dhapakhel
2        3   Samir   22   male    Tinkune
4        5  Aayush   16   male   Kuleswor

In [15]:
#select multiple rows by integer indexes
df.iloc[[0,2]]

   stud_id   name  age gender    address
0        1   Amit   24   male  Dhapakhel
2        3  Samir   22   male    Tinkune

In [16]:
#filtering rows
df[df['age']>20]

   stud_id    name  age  gender    address
0        1    Amit   24    male  Dhapakhel
1        2  Yojana   22  female      Kapan
2        3   Samir   22    male    Tinkune
3        4  Luckey   23  female  Balkumari

In [17]:
#Adding a new column to a dataframe
df['phone_no']=[10,20,30,40,50]
df

   stud_id    name  age  gender    address  phone_no
0        1    Amit   24    male  Dhapakhel        10
1        2  Yojana   22  female      Kapan        20
2        3   Samir   22    male    Tinkune        30
3        4  Luckey   23  female  Balkumari        40
4        5  Aayush   16    male   Kuleswor        50

In [19]:
#Deleting a column from a dataframe
df=df.drop(columns=['phone_no'])
df

   stud_id    name  age  gender    address
0        1    Amit   24    male  Dhapakhel
1        2  Yojana   22  female      Kapan
2        3   Samir   22    male    Tinkune
3        4  Luckey   23  female  Balkumari
4        5  Aayush   16    male   Kuleswor

In [21]:
#Rename the "old_name" column to "new_name"
#df = df.rename(columns={'old_name':'new_name'})
df = df.rename(columns={'age':'student_age'})
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male  Dhapakhel
1        2  Yojana           22  female      Kapan
2        3   Samir           22    male    Tinkune
3        4  Luckey           23  female  Balkumari
4        5  Aayush           16    male   Kuleswor

In [22]:
df['phone_no']=[10,20,30,40,50]
df

   stud_id    name  student_age  gender    address  phone_no
0        1    Amit           24    male  Dhapakhel        10
1        2  Yojana           22  female      Kapan        20
2        3   Samir           22    male    Tinkune        30
3        4  Luckey           23  female  Balkumari        40
4        5  Aayush           16    male   Kuleswor        50

In [23]:
#Deleting a column from a DataFrame
del df['phone_no']
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male  Dhapakhel
1        2  Yojana           22  female      Kapan
2        3   Samir           22    male    Tinkune
3        4  Luckey           23  female  Balkumari
4        5  Aayush           16    male   Kuleswor

In [24]:
#deleting a row from DataFrame
df=df.drop(4)
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male  Dhapakhel
1        2  Yojana           22  female      Kapan
2        3   Samir           22    male    Tinkune
3        4  Luckey           23  female  Balkumari

In [25]:
#adding a new row in existing DataFrame
df.loc[4]=[5,'Aayush',16,'male','Kuleswor']
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male  Dhapakhel
1        2  Yojana           22  female      Kapan
2        3   Samir           22    male    Tinkune
3        4  Luckey           23  female  Balkumari
4        5  Aayush           16    male   Kuleswor

In [26]:
#updating the values
df.loc[2,'student_age']=19
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male  Dhapakhel
1        2  Yojana           22  female      Kapan
2        3   Samir           19    male    Tinkune
3        4  Luckey           23  female  Balkumari
4        5  Aayush           16    male   Kuleswor

In [28]:
#Updating the multiple values
df.loc[[0,2],'address']=['andaman','nicobar']
df

   stud_id    name  student_age  gender    address
0        1    Amit           24    male    andaman
1        2  Yojana           22  female      Kapan
2        3   Samir           19    male    nicobar
3        4  Luckey           23  female  Balkumari
4        5  Aayush           16    male   Kuleswor

In [32]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
df = pd.read_csv(url)

In [33]:
print("First 5 Rows:")
print(df.head())

print("\nLast 5 Rows:")
print(df.tail())

First 5 Rows:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

Last 5 Rows:
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [34]:
print("Dataset Info:")
df.info()

Dataset Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [35]:
print("Summary Statistics:")
print(df.describe())

Summary Statistics:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [36]:
filtered_df = df[(df['Sex'] == 'female') & (df['Age'] > 30)]
print(filtered_df)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
11            12         1       1
15            16         1       2
18            19         0       3
..           ...       ...     ...
862          863         1       1
865          866         1       2
871          872         1       1
879          880         1       1
885          886         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
..                                                 ...     ...   ...    ...
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
3        0    113803  53.1000  C123        S
11       0    113783  26.5500  C103        S
15       0    248706  16.0000   NaN        S
18       0    345763  18.0000   NaN        S
..     ...       ...      ...   ...      ...
862      0     17466  25.9292   D17        S
865      0    236852  13.0000   NaN        S
871      1     11751  52.5542   D35        S
879      1     11767  83.1583   C50        C
885      5    382652  29.1250   NaN        Q

[103 rows x 12 columns]

In [37]:
sorted_df = df.sort_values(by=['Pclass', 'Age']).reset_index(drop=True)
print(sorted_df.head())

   PassengerId  Survived  Pclass                                 Name     Sex  \
0          306         1       1       Allison, Master. Hudson Trevor    male
1          298         0       1         Allison, Miss. Helen Loraine  female
2          446         1       1            Dodge, Master. Washington    male
3          803         1       1  Carter, Master. William Thornton II    male
4          436         1       1            Carter, Miss. Lucile Polk  female

     Age  SibSp  Parch  Ticket      Fare    Cabin Embarked
0   0.92      1      2  113781  151.5500  C22 C26        S
1   2.00      1      2  113781  151.5500  C22 C26        S
2   4.00      0      2   33638   81.8583      A34        S
3  11.00      1      2  113760  120.0000  B96 B98        S
4  14.00      1      2  113760  120.0000  B96 B98        S